jumping22/honeycomb/bsp/stm32f4xx-HAL-BOX/applications/main.c
/*
 * File      : main.c
 * This file is part of RT-Thread RTOS
 * COPYRIGHT (C) 2009, RT-Thread Development Team
 *
 * The license and distribution terms for this file may be
 * found in the file LICENSE in this distribution or at
 * http://www.rt-thread.org/license/LICENSE
 *
 * Change Logs:
 * Date           Author       Notes
 * 2015-07-29     Arda.Fu      first implementation
 */
#include <rtthread.h>
#include <board.h>

/* dfs filesystem:ELM filesystem init */
#include <dfs_elm.h>
/* dfs Filesystem APIs */
#include <dfs_fs.h>
#include <dfs_posix.h>

//#include <easyflash.h>
#include <rthw.h>
#include "proto.h"


//#include "my_exti.h"
#include "ST7735R.h"
#include "max7219.h"
#include "timer.h"
#include "adc.h"
#include "dht11.h"
#include "ds18b20.h"
#include "define.h"
#include "CGQ.h"
#include "dzp1.h"
#include "SMG.h"
#include "GUI.h"
#include "CGQ.h"




static struct rt_thread mega32u4_uart;
ALIGN(4)
static rt_uint8_t mega32u4_uart_thread_stack[4096];
static void mega32u4_uart_thread(void* parameter);



void proto_init(void);
void idle_hook_function(void);
void vPortSetupTimerInterrupt( void );
void vPortSuppressTicksAndSleep( uint32_t xExpectedIdleTime );

void LCD_SHOWTITLE(void);
void Light_Pin_Init(void);
void Exti_Pin_Init(void);
void Light_thread_entry(void* parameter);
uint8_t CGQ_Read(rt_base_t cgq);
void CGQ_Test(void* parameter);
void CGQ_ADC_Test(void* parameter);
void WD_R_Test(void* parameter);
void PWM_Test(void* parameter);
void LCD_Test(void* parameter);
void fmq_init(void);
void mada_gpio_init(void);
void dianji_gpio_init(void);
void led_init(void);
void YG_KEY_gpio_init(void);
void LIGHT_CLR(void);
void CGQ_gpio_init(void);

#include "stm32f4xx_hal.h"
void StandbyMode_Measure(void)
{

  HAL_PWR_DisableWakeUpPin(PWR_WAKEUP_PIN1);

  HAL_PWR_EnableWakeUpPin(PWR_WAKEUP_PIN1);

  HAL_PWR_EnterSTANDBYMode();

}

extern int multi_button_test(void);


void YG_KEY_gpio_init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
 
	__HAL_RCC_GPIOC_CLK_ENABLE();
	
	/*Configure GPIO pin : PtPin */
  GPIO_InitStruct.Pin = GPIO_PIN_0;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_PULLUP;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
	
}


void led_init(void)
{
		GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
 
	__HAL_RCC_GPIOF_CLK_ENABLE();
	
	/*Configure GPIO pin : PtPin */
  GPIO_InitStruct.Pin = GPIO_PIN_0;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOF, &GPIO_InitStruct);
	
	
}

void dianji_gpio_init(void)
{
		GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
 
	__HAL_RCC_GPIOC_CLK_ENABLE();
	__HAL_RCC_GPIOD_CLK_ENABLE();
	__HAL_RCC_GPIOE_CLK_ENABLE();
	/*Configure GPIO pin : PtPin */
  GPIO_InitStruct.Pin = GPIO_PIN_7|GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
	
	 GPIO_InitStruct.Pin = GPIO_PIN_9;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOE, &GPIO_InitStruct);
	
	 GPIO_InitStruct.Pin = GPIO_PIN_12;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_HIGH;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
}




void idle_hook_function(void)
{
	struct rt_object_information *information;
	struct rt_object *object;
	struct rt_list_node *node;
	uint32_t xExpectedIdleTime = 0;
	uint32_t next_timeout = 0;
	
	/* enter critical */
	if (rt_thread_self() != RT_NULL)
			rt_enter_critical();

	/* 循环遍历 寻找Ready最短时间 或 Suspend最短时间 */
	information = rt_object_get_information(RT_Object_Class_Thread);
	RT_ASSERT(information != RT_NULL);
	for (node  = information->object_list.next;
			 node != &(information->object_list);
			 node  = node->next)
	{
		object = rt_list_entry(node, struct rt_object, list);
		
		if (RT_THREAD_READY == ((rt_thread_t)object)->stat) {
			//if (rt_strncmp(object->name, "tidle", RT_NAME_MAX) != 0) {
				//rt_kprintf("Ready name:%s, left tick:%d, state: %d\r\n", object->name, ((rt_thread_t)object)->remaining_tick, ((rt_thread_t)object)->stat);
				if (((rt_thread_t)object)->remaining_tick > 0) {
					if (xExpectedIdleTime == 0) {
						xExpectedIdleTime = ((rt_thread_t)object)->remaining_tick;
					} else {	//寻找最小
						xExpectedIdleTime = ((rt_thread_t)object)->remaining_tick < xExpectedIdleTime? ((rt_thread_t)object)->remaining_tick:xExpectedIdleTime;
					}
				}
			//}
		} else if(RT_THREAD_SUSPEND == ((rt_thread_t)object)->stat) {
			//if (rt_strncmp(object->name, "tidle", RT_NAME_MAX) != 0) {
				//rt_kprintf("Suspend name:%s, left tick:%d, state: %d\r\n", object->name, ((rt_thread_t)object)->remaining_tick, ((rt_thread_t)object)->stat);
				if (((rt_thread_t)object)->thread_timer.timeout_tick > 0) {
					if (xExpectedIdleTime == 0) {
						xExpectedIdleTime = ((rt_thread_t)object)->thread_timer.timeout_tick - rt_tick_get();
					} else {
						uint32_t _idletime = ((rt_thread_t)object)->thread_timer.timeout_tick - rt_tick_get();
						xExpectedIdleTime = _idletime < xExpectedIdleTime? _idletime:xExpectedIdleTime;
					}
				}
			//}
		}
	}

	next_timeout = rt_timer_next_timeout_tick();
	if (xExpectedIdleTime > 10) {
		//rt_kprintf("Suspend name:%s, left tick:%d, state: %d\r\n", object->name, ((rt_thread_t)object)->remaining_tick, ((rt_thread_t)object)->stat);
		//rt_kprintf("enter tick:%d\r\n", rt_tick_get());
		rt_enter_critical();
		vPortSuppressTicksAndSleep(xExpectedIdleTime);
		rt_exit_critical();
		//rt_kprintf("exit tick:%d\r\n", rt_tick_get());
	}
	
//	for (node  = information->object_list.next;
//			 node != &(information->object_list);
//			 node  = node->next)
//	{
//		object = rt_list_entry(node, struct rt_object, list);
//		
//		if (RT_THREAD_READY == ((rt_thread_t)object)->stat) {
//			if (rt_strncmp(object->name, "tidle", RT_NAME_MAX) != 0) {
//				//rt_kprintf("Ready name:%s, left tick:%d, state: %d\r\n", object->name, ((rt_thread_t)object)->remaining_tick, ((rt_thread_t)object)->stat);
//				xExpectedIdleTime = ((rt_thread_t)object)->remaining_tick;
//			}
//		} else if(RT_THREAD_SUSPEND == ((rt_thread_t)object)->stat) {
//			if (rt_strncmp(object->name, "tidle", RT_NAME_MAX) != 0) {
//				//rt_kprintf("Suspend name:%s, left tick:%d, state: %d\r\n", object->name, ((rt_thread_t)object)->remaining_tick, ((rt_thread_t)object)->stat);
//				xExpectedIdleTime = ((rt_thread_t)object)->thread_timer.timeout_tick > 0? ((rt_thread_t)object)->thread_timer.timeout_tick - rt_tick_get():0;
//				
//				if (xExpectedIdleTime > 10) {
//					//rt_kprintf("Suspend name:%s, left tick:%d, state: %d\r\n", object->name, ((rt_thread_t)object)->remaining_tick, ((rt_thread_t)object)->stat);
//					//rt_kprintf("enter tick:%d\r\n", rt_tick_get());
//					rt_enter_critical();
//					vPortSuppressTicksAndSleep(xExpectedIdleTime);
//					rt_exit_critical();
//					//rt_kprintf("exit tick:%d\r\n", rt_tick_get());
//				}
//				
//			}
//		}
//	}
	
