jumping22/honeycomb/bsp/stm32f4xx-HAL-BOX/applications/main.c
			/* The tick interrupt handler will already have pended the tick
			processing in the kernel.  As the pending tick will be
			processed as soon as this function exits, the tick value
			maintained by the tick is stepped forward by one less than the
			time spent waiting. */
			ulCompleteTickPeriods = xExpectedIdleTime - 1UL;
		}
		else
		{
			/* Something other than the tick interrupt ended the sleep.
			Work out how long the sleep lasted rounded to complete tick
			periods (not the ulReload value which accounted for part
			ticks). */
			ulCompletedSysTickDecrements = ( xExpectedIdleTime * ulTimerCountsForOneTick ) - portNVIC_SYSTICK_CURRENT_VALUE_REG;

			/* How many complete tick periods passed while the processor
			was waiting? */
			ulCompleteTickPeriods = ulCompletedSysTickDecrements / ulTimerCountsForOneTick;

			/* The reload value is set to whatever fraction of a single tick
			period remains. */
			portNVIC_SYSTICK_LOAD_REG = ( ( ulCompleteTickPeriods + 1UL ) * ulTimerCountsForOneTick ) - ulCompletedSysTickDecrements;
		}

		/* Restart SysTick so it runs from portNVIC_SYSTICK_LOAD_REG
		again, then set portNVIC_SYSTICK_LOAD_REG back to its standard
		value.  The critical section is used to ensure the tick interrupt
		can only execute once in the case that the reload register is near
		zero. */
		portNVIC_SYSTICK_CURRENT_VALUE_REG = 0UL;
		portNVIC_SYSTICK_CTRL_REG |= portNVIC_SYSTICK_ENABLE_BIT;
		rt_tick_set(rt_tick_get() + ulCompleteTickPeriods);
		portNVIC_SYSTICK_LOAD_REG = ulTimerCountsForOneTick - 1UL;
		
		__enable_irq();
	}
}
	
	

static void SYSCLKConfig_STOP(void)
{
  RCC_ClkInitTypeDef RCC_ClkInitStruct;
  RCC_OscInitTypeDef RCC_OscInitStruct;
  uint32_t pFLatency = 0;
  
  /* Get the Oscillators configuration according to the internal RCC registers */
  HAL_RCC_GetOscConfig(&RCC_OscInitStruct);
  
  /* After wake-up from STOP reconfigure the system clock: Enable HSE and PLL */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState = RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  if(HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    rt_kprintf("HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK\n");
  }

  /* Get the Clocks configuration according to the internal RCC registers */
  HAL_RCC_GetClockConfig(&RCC_ClkInitStruct, &pFLatency);
  
  /* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2 
     clocks dividers */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_SYSCLK;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  if(HAL_RCC_ClockConfig(&RCC_ClkInitStruct, pFLatency) != HAL_OK)
  {
    rt_kprintf("HAL_RCC_ClockConfig(&RCC_ClkInitStruct, pFLatency) != HAL_OK\n");
  }
}




/***********************************FreeRTOS tickless移植**************************************/

#define PROTO_BUFFER_SIZE			120

static rt_device_t proto_uart;
static rt_sem_t proto_sem;
static uint8_t proto_buffer[PROTO_BUFFER_SIZE];
static rt_size_t real_length;

static void _proto_send(uint8_t *buf, uint16_t size)
{
	rt_device_write(proto_uart, 0, buf, size);
}

static rt_err_t _proto_rx_ind(rt_device_t dev, rt_size_t size)
{
	int i = 0;
//	char *p;
	real_length = rt_device_read( proto_uart, 0, proto_buffer, PROTO_BUFFER_SIZE );
	
//	for (; i<real_length; i++) {
//		rt_kprintf("%x ", proto_buffer[i]);
////		_proto_send(&proto_buffer[i],2);
////		if(proto_buffer[i]==0xa5)
////		{
//			_proto_send("5a",2);
////		}
//	}
	
	for (;i<real_length;i++) {
		//rt_kprintf("%x ", proto_buffer[i]);
		if (Proto_data_analyze_byte(proto_buffer[i]) ) {
			rt_sem_release(proto_sem);
		}
	}
	return 0;
}



void proto_init(void)
{
	rt_err_t result;
	rt_serial_t *pserial;
	
	proto_uart = rt_device_find("uart2");
	
	if( proto_uart == RT_NULL )
	{
		rt_kprintf("Init proto use uart error\n");
		return;
	}
	
	pserial = (rt_serial_t*)proto_uart;
	
	pserial->config.baud_rate = BAUD_RATE_38400;
	
	if (rt_device_open(proto_uart, RT_DEVICE_OFLAG_RDWR | RT_DEVICE_FLAG_INT_RX ) != RT_EOK) {
		rt_kprintf("Init proto uart open error\n");
		return;
	}
	rt_device_set_rx_indicate(proto_uart, _proto_rx_ind);	//uart set callback
	
	rt_device_control(proto_uart, RT_DEVICE_CTRL_CONFIG, pserial );
	
	proto_sem = rt_sem_create("mega32u4_proto_sem", 0, RT_IPC_FLAG_FIFO);

	result = rt_thread_init(&mega32u4_uart,
													"mega32u4_uart",
													mega32u4_uart_thread,
													RT_NULL,
													&mega32u4_uart_thread_stack[0],
													sizeof(mega32u4_uart_thread_stack),
													9,
													10);
	if (result == RT_EOK) {
		rt_thread_startup(&mega32u4_uart);
	}
}


static void mega32u4_uart_thread(void* parameter)
{

	proto_set_sendFunc(_proto_send);	//set proto uart send function
	
	while (1)
	{
		if (rt_sem_take( proto_sem, RT_WAITING_FOREVER) == RT_EOK)	//1.5s  RT_WAITING_FOREVER
		{
			//rt_kprintf("Now tick:%d\r\n", rt_tick_get());
			Proto_sensor_cmd_deal();
		}
		rt_kprintf("Now tick:%d\r\n", rt_tick_get());
		//rt_thread_delay(10);
	}
}


void test_print(void **argv, char *argc)
{
	rt_kprintf("shangwudong\r\n");
}
MSH_CMD_EXPORT(test_print, test print shangwudong);


void Light_Pin_Init()
{		
	rt_pin_mode(RGB_R,PIN_MODE_OUTPUT);	//RGB	
	rt_pin_mode(RGB_G,PIN_MODE_OUTPUT);	
	rt_pin_mode(RGB_B,PIN_MODE_OUTPUT);
	
	HAL_GPIO_WritePin(GPIOE, GPIO_PIN_11 | GPIO_PIN_13 | GPIO_PIN_14,GPIO_PIN_SET);
//	rt_pin_mode(RGB_R2,PIN_MODE_OUTPUT);	//RGB2		
//	rt_pin_mode(RGB_G2,PIN_MODE_OUTPUT);	
//	rt_pin_mode(RGB_B2,PIN_MODE_OUTPUT);
//		
//	rt_pin_mode(RGB_R3,PIN_MODE_OUTPUT);//RGB3		
//	rt_pin_mode(RGB_G3,PIN_MODE_OUTPUT);	
//	rt_pin_mode(RGB_B3,PIN_MODE_OUTPUT);
//	
//	rt_pin_mode(RGB_R4,PIN_MODE_OUTPUT);//RGB4		
//	rt_pin_mode(RGB_G4,PIN_MODE_OUTPUT);	
//	rt_pin_mode(RGB_B4,PIN_MODE_OUTPUT);
//	
//	rt_pin_mode(LED0,PIN_MODE_OUTPUT);
}



void Light_thread_entry(void* parameter) 
{
	Light_Pin_Init();
	while(1)
	{
		rt_pin_write(RGB_R, PIN_LOW);
		rt_pin_write(RGB_G, PIN_LOW);
		rt_pin_write(RGB_B, PIN_LOW);

//		rt_pin_write(LED0, PIN_LOW);
//		HAL_GPIO_WritePin(GPIOF,GPIO_PIN_0,GPIO_PIN_RESET);
		rt_thread_delay(rt_tick_from_millisecond(500));
		rt_pin_write(RGB_R, PIN_HIGH);
		rt_pin_write(RGB_G, PIN_HIGH);
		rt_pin_write(RGB_B, PIN_HIGH);

//		rt_pin_write(LED0, PIN_HIGH);
//		HAL_GPIO_WritePin(GPIOF,GPIO_PIN_0,GPIO_PIN_SET);
		rt_thread_delay(rt_tick_from_millisecond(500));
	}
}

uint8_t CGQ_Read(rt_base_t cgq)
{
		
		if(rt_pin_read(cgq)==1)
		{	
			rt_thread_delay(rt_tick_from_millisecond(10));
			if(rt_pin_read(cgq)==1)
			{
				rt_kprintf("\r CGQ:%u \n",cgq);
				//while(rt_pin_read(cgq)==0);
				return 0;
			}
		}
		return 1;
}

void CGQ_Test(void* parameter)
{
	
