jumping22/honeycomb/bsp/stm32f4xx-HAL-BOX/applications/main.c
//	rt_pin_mode(YG_5SW_KEY1,PIN_MODE_INPUT);
//	rt_pin_mode(YG_5SW_KEY2,PIN_MODE_INPUT);
//	rt_pin_mode(YG_5SW_KEY3,PIN_MODE_INPUT);
//	rt_pin_mode(YG_5SW_KEY4,PIN_MODE_INPUT);
//	rt_pin_mode(YG_5SW_KEY5,PIN_MODE_INPUT);
//	rt_pin_mode(RTHW,PIN_MODE_INPUT);
//	rt_pin_mode(SY_D0,PIN_MODE_INPUT);
//	rt_pin_mode(GMDZ,PIN_MODE_INPUT);
//	rt_pin_mode(JIUJING,PIN_MODE_INPUT);
	while(1)
	{
//		CGQ_Read(KEY1);
//		CGQ_Read(KEY2);
//		CGQ_Read(KEY3);
//		CGQ_Read(KEY4);
//		CGQ_Read(YG_5SW_KEY1);
//		CGQ_Read(YG_5SW_KEY2);
//		CGQ_Read(YG_5SW_KEY3);
//		CGQ_Read(YG_5SW_KEY4);
//		CGQ_Read(YG_5SW_KEY5);
//		CGQ_Read(SY_D0);
//		CGQ_Read(GMDZ);
//   	CGQ_Read(RTHW);
//		CGQ_Read(JIUJING);
		rt_thread_delay(1000);
	}
}



void CGQ_ADC_Test(void* parameter)
{
	MX_ADC3_Init();
	//MX_ADC1_Init();
	//jiujing_gpio_init();
	while(1)
	{
//		rt_kprintf("\r YG_X:%u \n",Get_Adc1_Average(YG_X_ADC_CH,10));//A0+
//		rt_kprintf("\r YG_Y:%u \n",Get_Adc1_Average(YG_Y_ADC_CH ,10));//A1
//		rt_kprintf("\r SY:%u \n",Get_Adc1_Average(SY_ADC_CH,10));//A2
//		rt_kprintf("\r XZHDWQ:%u \n",Get_Adc1_Average(XZHDWQ_ADC_CH,10));//A3
		rt_kprintf("\r BAT:%u \n",Get_Adc3_Average(ADC_CHANNEL_7,10));//F9
		rt_thread_delay(500);
	}
}

void WD_R_Test(void* parameter)
{
	uint8_t tem,hum;
	DS18B20_Init();
	DHT11_Init();
	while(1)
	{
		rt_thread_delay(100);
		DHT11_Read_Data(&tem,&hum);
		rt_kprintf("\r WD_DS18B20:%u \n",DS18B20_Get_Temp());
		rt_kprintf("\r WD_DHT11:%u \n",tem);
		rt_kprintf("\r WD_DHT11:%u \n",hum);
		rt_kprintf("\r\n");
	}
}


void PWM_Test(void* parameter)
{
	uint8_t dir=1;
	uint16_t led0pwmval=0;
	//TIM3_PWM_Init(500-1,84-1);//2-5KHZ  FMQ  500--200
	TIM4_PWM_Init(500-1,84-1);//MADA
	rt_kprintf("\r PWM_Test \n");
	while(1)
	{
		rt_thread_delay(10);	 	
		if(dir)led0pwmval++;				//dir==1 led0pwmval递增
		else led0pwmval--;					//dir==0 led0pwmval递减 
		if(led0pwmval>300)dir=0;			//led0pwmval到达300后，方向为递减
		if(led0pwmval==0)dir=1;				//led0pwmval递减到0后，方向改为递增
		TIM_SetTIM4Compare1(led0pwmval);	//修改比较值，修改占空比,电机调速
		//TIM3_Set_freq(200+led0pwmval);//蜂鸣器变频率
	}
}

void LCD_Test(void* parameter)
{
//		LCD_Pin_Conf();
//		//MX_SPI2_Init();
//		lcd_spi_gpio_init();
//		Lcd_Init();
//		Lcd_Clear(BLUE);
//		rt_kprintf("\r LCD_Test \n");
//	LCD_drawline(1,1,100,100,BLACK);
//	LCD_drawrect(50,50,100,100,RED,1);
//	LCD_drawcircle(50,50,50,BLACK);
//  LCD_ShowString(10,10,RED,3,16,"1234");
	while(1)
	{
//		Lcd_Clear(RED);
		rt_thread_delay(500);
//		Lcd_Clear(GREEN);
//		rt_thread_delay(500);
	}
}

void _Error_Handler(char *file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}




int flag_dht11 = 0;
extern uint8_t value89;
uint8_t temp,temp1;
//static uint8_t tem = 0;
//static uint8_t hum = 0;





/* 线程1控制块 */
static struct rt_thread thread_sensor;
/* 线程1栈 */
ALIGN(4)
static rt_uint8_t thread_sensor_stack[4096];

static void thread_sensor_entry(void* parameter)
{
//	rt_uint32_t count = 0;

	while (1)
	{
		DZP_deal();
		DZP1_deal();
		MOTOR_deal();
		DHT11_deal();
		DS18B20_deal();
		YG_deal();
		jiujing_deal();
		XZDWQ_deal();
		SOUNDSENSOR_deal();	
		Dial_deal();
		traffic_deal();
		GUI_deal();
		rt_thread_delay(10);
	}
}

//线程2控制块
static struct rt_thread thread_emwin;
//线程2栈
ALIGN(4)
static rt_uint8_t thread_emwin_stack[4096];

static void thread_emwin_entry(void* parameter)
{

//	Traffic_light(0,1,0);
//	rt_thread_delay(10);
//	
}

//extern void MainTask(void);
uint8_t temp = 0;
int main(void)
{
	__HAL_RCC_CRC_CLK_ENABLE();
	
	MX_ADC3_Init();
	
	while(Get_Adc3(ADC_CHANNEL_8)>200) ;//开机
	
	HAL_Init();
	//rt_pin_mode(44, PIN_MODE_INPUT); 
	rt_pin_mode(74, PIN_MODE_OUTPUT);
	//if (rt_pin_read(44) == PIN_HIGH)
	//{
			rt_pin_write(74, PIN_HIGH);
	//}
	
		vPortSetupTimerInterrupt();
    /* user app entry */
//		rt_components_board_init();
//		rt_console_set_device("vcom");
//		libc_system_init();
//		easyflash_init();

		/* mount sd card fat partition 1 as root directory */  
		if (dfs_mount("flash0", "/", "elm", 0, 0) == 0) {
				rt_kprintf("flash0 mount to /.\n");  
		} else {
				rt_kprintf("flash0 mount to / failed!, fatmat and try again!\n");
				/* fatmat filesystem. */
				dfs_mkfs("elm", "flash0");
				/* re-try mount. */
				if (dfs_mount("flash0", "/", "elm", 0, 0) != 0) {
						rt_kprintf("sd0 mount to / failed.\n"); 
				}
		}

		

		VCC_Enable_init();//32u4供电管脚初始化
		HAL_GPIO_WritePin(GPIOA,GPIO_PIN_8,GPIO_PIN_SET);	
		
		//StandbyMode_Measure();
	
		Light_Pin_Init();//rgb灯初始化
		TIM3_PWM_Init(500-1,84-1);//2-5KHZ  FMQ  500--200蜂鸣器初始化
		TIM4_PWM_Init(500-1,84-1);//MADA初始化
		
//		Init_MAX7219();//点阵屏左初始化		
//		Init_DZP1();//点阵屏右初始化
		
		MX_ADC1_Init();//
		YG_KEY_gpio_init();//摇杆按键初始化
		Sound_init();//声音模块初始化
		DS18B20_Init();//温度传感器初始化
		//MX_ADC3_Init();

		SMG_init();//数码管初始化
		DHT11_Init();//温湿度初始化
		RTHW_init();//人体红外初始化
		sw5_key_init();//五向按键初始化
		LIGHT_init();//光敏电阻初始化
		LCD_Pin_Conf();		//lcd io口初始化
		MX_SPI2_Init();//LCD spi初始化
	  HAL_GPIO_WritePin(GPIOB,GPIO_PIN_12,GPIO_PIN_RESET);//LCD片选脚拉低
	  Lcd_Init();//LCD初始化
		Lcd_Clear(BLACK);//LCD清屏
		LCD_show_image();//蓝宙logo显示
		HAL_GPIO_WritePin(GPIOG,GPIO_PIN_4,GPIO_PIN_SET) ;
		GD_init();//光电开关初始化
		GZ_init();//滚珠开关初始化
		MQ_CON_init();//酒精控制管脚初始化
		//HAL_GPIO_WritePin(GPIOF,GPIO_PIN_3,GPIO_PIN_SET);//酒精传感器电源控制端，在调度时使用
		
			Init_DZP1();
			Write_DZP1(1,0<<1);
			Write_DZP1(2,0<<1);
			Write_DZP1(3,0<<1);
			Write_DZP1(4,0<<1);
			Write_DZP1(5,0<<1);
		
			Init_MAX7219(); 
			Write_Max7219(1, 0<<1);
			Write_Max7219(2, 0<<1);
			Write_Max7219(3, 0<<1);
			Write_Max7219(4, 0<<1);
			Write_Max7219(5, 0<<1);
		
		
		HAL_Delay(3000);
		GUI_Init();
		proto_init();

		rt_thread_idle_sethook(idle_hook_function);
		
		multi_button_test();
		
//创建线程1	
	rt_err_t result = rt_thread_init(&thread_sensor, "thread_sensor", thread_sensor_entry, RT_NULL, &thread_sensor_stack[0], sizeof(thread_sensor_stack), 5, 10);
	if (result == RT_EOK)
		rt_thread_startup(&thread_sensor);
	

//创建线程2：emwin
	rt_err_t result_emwin = rt_thread_init(&thread_emwin, "thread_emwin", thread_emwin_entry, RT_NULL,&thread_emwin_stack[0], sizeof(thread_emwin_stack), 6, 10);
	if (result_emwin == RT_EOK)
		rt_thread_startup(&thread_emwin);
	
//max7219_test();
	while(1)
	{
			SMG_show(value89);
			rt_thread_delay(10);

	}
}




